Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.5.75/samv70/edc/ATSAMV70Q20.PIC
      <edc:SFRDef edc:_addr="0x4002C05C" edc:access="-------------rrrrrrrrrrrrrrrrrrr" edc:cname="US_LINBRR" edc:impl="0x7FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="LINCD" edc:desc="Clock Divider after Synchronization" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="LINFP" edc:desc="Fractional Part after Synchronization" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C060" edc:access="--------nnnnnnnn----------nnnnnn" edc:cname="US_LONMR" edc:impl="0xFF003F" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="COMMT" edc:desc="LON comm_type Parameter Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COLDET" edc:desc="LON Collision Detection Feature" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOL" edc:desc="Terminate Frame upon Collision Notification" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CDTAIL" edc:desc="LON Collision Detection on Frame Tail" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMAM" edc:desc="LON DMA Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCDS" edc:desc="LON Collision Detection Source" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="EOFS" edc:desc="End of Frame Condition Size" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C064" edc:access="------------------nnnnnnnnnnnnnn" edc:cname="US_LONPR" edc:impl="0x3FFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="LONPL" edc:desc="LON Preamble Length" edc:nzwidth="0xE"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C068" edc:access="------------------------nnnnnnnn" edc:cname="US_LONDL" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="LONDL" edc:desc="LON Data Length" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C06C" edc:access="------------------------nnnnnnnn" edc:cname="US_LONL2HDR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="BLI" edc:desc="LON Backlog Increment" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="ALTP" edc:desc="LON Alternate Path Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PB" edc:desc="LON Priority Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C070" edc:access="--------------------------rrrrrr" edc:cname="US_LONBL" edc:impl="0x3F" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="LONBL" edc:desc="LON Node Backlog Value" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C074" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_LONB1TX" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="BETA1TX" edc:desc="LON Beta1 Length after Transmission" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C078" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_LONB1RX" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="BETA1RX" edc:desc="LON Beta1 Length after Reception" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C07C" edc:access="-----------------nnnnnnn-nnnnnnn" edc:cname="US_LONPRIO" edc:impl="0x7F7F" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="PSNB" edc:desc="LON Priority Slot Number" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NPS" edc:desc="LON Node Priority Slot" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C080" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_IDTTX" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="IDTTX" edc:desc="LON Indeterminate Time after Transmission (comm_type = 1 mode only)" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C084" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_IDTRX" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="IDTRX" edc:desc="LON Indeterminate Time after Reception (comm_type = 1 mode only)" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C088" edc:access="----------------------------nnnn" edc:cname="US_ICDIFF" edc:impl="0xF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="ICDIFF" edc:desc="IC Differentiator Number" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4002C08C" edc:offset="0x58"/>
      <edc:SFRDef edc:_addr="0x4002C0E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="US_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x555341"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C0E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="US_WPSR" edc:impl="0xFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4002C0EC" edc:offset="0x3F14"/>
      <edc:SFRDef edc:_addr="0x40030000" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MCAN0_CREL" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="DAY" edc:desc="Timestamp Day" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="MON" edc:desc="Timestamp Month" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="YEAR" edc:desc="Timestamp Year" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SUBSTEP" edc:desc="Sub-step of Core Release" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="STEP" edc:desc="Step of Core Release" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REL" edc:desc="Core Release" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40030004" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MCAN0_ENDN" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="ETV" edc:desc="Endianness Test Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
