Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.5.75/samv70/edc/ATSAMV70Q20.PIC
      <edc:SFRDef edc:_addr="0x40060024" edc:access="----------wwww-w----wwwwwwww-www" edc:cname="TWIHS2_IER" edc:impl="0x3D0FF7" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS2">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Transmission Completed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receive Holding Register Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Holding Register Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:desc="Slave Access Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:desc="General Call Access Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Underrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Not Acknowledge Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:desc="Arbitration Lost Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCL_WS" edc:desc="Clock Wait State Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:desc="End Of Slave Access Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MCACK" edc:desc="Master Code Acknowledge Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:desc="Timeout Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECERR" edc:desc="PEC Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBDAM" edc:desc="SMBus Default Address Match Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBHHM" edc:desc="SMBus Host Header Address Match Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40060028" edc:access="----------wwww-w----wwwwwwww-www" edc:cname="TWIHS2_IDR" edc:impl="0x3D0FF7" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS2">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Transmission Completed Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receive Holding Register Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Holding Register Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:desc="Slave Access Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:desc="General Call Access Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Underrun Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Not Acknowledge Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:desc="Arbitration Lost Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCL_WS" edc:desc="Clock Wait State Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:desc="End Of Slave Access Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MCACK" edc:desc="Master Code Acknowledge Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:desc="Timeout Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECERR" edc:desc="PEC Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBDAM" edc:desc="SMBus Default Address Match Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBHHM" edc:desc="SMBus Host Header Address Match Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006002C" edc:access="----------rrrr-r----rrrrrrrr-rrr" edc:cname="TWIHS2_IMR" edc:impl="0x3D0FF7" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS2">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Transmission Completed Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receive Holding Register Ready Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Holding Register Ready Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:desc="Slave Access Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:desc="General Call Access Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Underrun Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Not Acknowledge Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:desc="Arbitration Lost Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCL_WS" edc:desc="Clock Wait State Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:desc="End Of Slave Access Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MCACK" edc:desc="Master Code Acknowledge Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:desc="Timeout Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECERR" edc:desc="PEC Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBDAM" edc:desc="SMBus Default Address Match Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBHHM" edc:desc="SMBus Host Header Address Match Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40060030" edc:access="------------------------rrrrrrrr" edc:cname="TWIHS2_RHR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS2">
            <edc:SFRFieldDef edc:cname="RXDATA" edc:desc="Master or Slave Receive Holding Data" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40060034" edc:access="------------------------wwwwwwww" edc:cname="TWIHS2_THR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS2">
            <edc:SFRFieldDef edc:cname="TXDATA" edc:desc="Master or Slave Transmit Holding Data" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40060038" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn----nnnn" edc:cname="TWIHS2_SMBTR" edc:impl="0xFFFFFF0F" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS2">
            <edc:SFRFieldDef edc:cname="PRESC" edc:desc="SMBus Clock Prescaler" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TLOWS" edc:desc="Slave Clock Stretch Maximum Cycles" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="TLOWM" edc:desc="Master Clock Stretch Maximum Cycles" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="THMAX" edc:desc="Clock High Maximum Cycles" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
